Tekla Open API Reference for Tekla Structures 2025
Polygon Constructor (ViewBase, PointList)
 Creates a new polygon instance with the point list using standard attributes.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Polygon(
	ViewBase view,
	PointList pointList
)
Public Sub New (
	view As ViewBase,
	pointList As PointList
)
Parameters
view
Type: Tekla.Structures.Drawing.ViewBase
The view to be used.
pointList
Type: Tekla.Structures.Drawing.PointList
The point list to be used.
See Also
Reference
Polygon Class
Polygon Overload
Tekla.Structures.Drawing Namespace